farandula-java/target/classes/travelport/XML.request/one-room.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <HotelCreateReservationReq TargetBranch="XXBRCH" AuthorizedBy="TEST" TraceId="65e4c8a3-ab1d-402d-8d47-8029528a5801" xmlns="http://www.travelport.com/schema/hotel_v37_0">
            <BillingPointOfSaleInfo OriginApplication="UAPI" xmlns="http://www.travelport.com/schema/common_v37_0"/>
            <BookingTraveler DOB="1960-10-09" Gender="M" Key="cf0f8433-4622-40e6-9ac5-01b3cbdb49c7" TravelerType="ADT" Age="51" xmlns="http://www.travelport.com/schema/common_v37_0">
                <BookingTravelerName First="John" Last="Doe"/>
                <PhoneNumber Number="525-5255" AreaCode="312" Type="Other" CountryCode="1" Location="ORD"/>
                <Email EmailID="john.doe@email.com" Type="Other"/>
            </BookingTraveler>
            <AgencyContactInfo xmlns="http://www.travelport.com/schema/common_v37_0">
                <PhoneNumber Number="1 303 2224444-4321" AreaCode="303" Text="Branch 654t" Type="Agency" CountryCode="1"/>
            </AgencyContactInfo>
            <CustomerID xmlns="http://www.travelport.com/schema/common_v37_0"/>
            <FileFinishingInfo xmlns="http://www.travelport.com/schema/common_v37_0">
                <ShopInformation/>
                <AccountInformation/>
                <AgencyInformation>
                    <Email EmailID="agency10.email@tp.com" Key="28897" Type="Home"/>
                    <PhoneNumber Number="565545454" AreaCode="111" Type="Fax" Key="325228" CountryCode="11"/>
                </AgencyInformation>
            </FileFinishingInfo>
            <HotelRateDetail Base="USD129.00" RatePlanType="KNGRACK" Total="USD436.54"/>
            <HotelProperty ParticipationLevel="Best Available Rate and Inside Shopper participant" ReserveRequirement="Other" Availability="Available" HotelTransportation="CourtesyBus" HotelCode="86178" HotelChain="HY" HotelLocation="DEN" Name="HYATT PLACE DENVER AIRPORT">
                <PropertyAddress>
                    <Address>16250 East 40th Avenue </Address>
                    <Address>Aurora CO US 80011 </Address>
                </PropertyAddress>
                <Distance Value="10" Direction="SW" xmlns="http://www.travelport.com/schema/common_v37_0"/>
            </HotelProperty>
            <HotelStay>
                <CheckinDate>2012-12-04</CheckinDate>
                <CheckoutDate>2012-12-07</CheckoutDate>
            </HotelStay>
            <Guarantee ExternalReference="196244e59c324ce2b006f2af534c01db" Type="Guarantee" xmlns="http://www.travelport.com/schema/common_v37_0">
                <CreditCard Number="4111111111111111" Type="VI" ExpDate="2015-09"/>
            </Guarantee>
            <GuestInformation NumberOfRooms="1">
                <NumberOfAdults>1</NumberOfAdults>
                <NumberOfChildren Count="0"/>
            </GuestInformation>
            <ActionStatus TicketDate="2012-09-01T23:59:00.0000000" Type="TAU" xmlns="http://www.travelport.com/schema/common_v37_0">
                <Remark/>
            </ActionStatus>
        </HotelCreateReservationReq>
    </SOAP:Body>
</SOAP:Envelope>
